lanpinguo/nuttx/boards/arm/stm32l4/nucleo-l452re/src/stm32_ir.c
  return 0;
}


static void stm32_irtim_worker(FAR void *arg)
{
  struct stm32_irtim_dev_s *dummy = arg;
  unsigned sample = dummy->test_sample;

  if (sample % 2 == 0)
    {
      sample = LIRC_SPACE(sample);
    }
  else
    {
      sample = LIRC_PULSE(sample);
    }

  lirc_sample_event(&dummy->lower, sample);

  rcinfo("Dummy RC read Raw Data from device:%d\n", sample);
  dummy->test_sample++;

  work_queue(LPWORK, &dummy->work, stm32_irtim_worker, dummy,
             STM32_IRTIM_WORK_PERIOD);
}

static int stm32_irtim_open(FAR struct lirc_lowerhalf_s *lower)
{
  struct stm32_irtim_dev_s *dummy = (struct stm32_irtim_dev_s *)lower;

  rcinfo("Called %s\n", __func__);

  dummy->test_sample = 0;
  return OK;
}

static void stm32_irtim_close(FAR struct lirc_lowerhalf_s *lower)
{
  struct stm32_irtim_dev_s *dummy = (struct stm32_irtim_dev_s *)lower;

  rcinfo("Called %s\n", __func__);

  work_cancel(LPWORK, &dummy->work);
}

static int stm32_irtim_s_tx_mask(FAR struct lirc_lowerhalf_s *lower,
                           unsigned int mask)
{
  rcinfo("Called %s, mask:%u\n", __func__, mask);
  return 0;
}

static int stm32_irtim_s_tx_carrier(FAR struct lirc_lowerhalf_s *lower,
                              unsigned int carrier)
{
  rcinfo("Called %s, carrier:%u\n", __func__, carrier);
  return 0;
}

static int stm32_irtim_s_tx_duty_cycle(FAR struct lirc_lowerhalf_s *lower,
                                 unsigned int duty_cycle)
{
  rcinfo("Called %s, duty_cycle:%u\n", __func__, duty_cycle);
  return 0;
}

static int stm32_irtim_s_rx_carrier_range(FAR struct lirc_lowerhalf_s *lower,
                                    unsigned int min, unsigned int max)
{
  rcinfo("Called %s, min:%u, max:%u\n", __func__, min, max);
  return 0;
}

// #define PHILIPS_MODE   1
// #define HAIR_MODE   1
#define GREE_MODE   1

#if defined(PHILIPS_MODE)
#define RAW_DATA_LEN     52 
uint32_t test_ir_raw[RAW_DATA_LEN][2] = {
		{ 3594, 1 }, 
		{ 7143, 0 }, 
		{ 526, 1 }, 
		{ 701, 0 }, 
		{ 568, 1 }, 
		{ 1648, 0 }, 
		{ 616, 1 }, 
		{ 628, 0 }, 
		{ 601, 1 }, 
		{ 622, 0 }, 
		{ 577, 1 }, 
		{ 650, 0 }, 
		{ 548, 1 }, 
		{ 1683, 0 }, 
		{ 600, 1 }, 
		{ 588, 0 }, 
		{ 641, 1 }, 
		{ 622, 0 }, 
		{ 575, 1 }, 
		{ 652, 0 }, 
		{ 525, 1 }, 
		{ 700, 0 }, 
		{ 569, 1 }, 
		{ 658, 0 }, 
		{ 595, 1 }, 
		{ 1639, 0 }, 
		{ 599, 1 }, 
		{ 628, 0 }, 
		{ 598, 1 }, 
		{ 1630, 0 }, 
		{ 603, 1 }, 
		{ 604, 0 }, 
		{ 621, 1 }, 
		{ 628, 0 }, 
		{ 600, 1 }, 
		{ 1626, 0 }, 
		{ 604, 1 }, 
		{ 604, 0 }, 
		{ 624, 1 }, 
		{ 1626, 0 }, 
		{ 509, 1 }, 
		{ 631, 0 }, 
		{ 625, 1 }, 
		{ 602, 0 }, 
		{ 624, 1 }, 
		{ 626, 0 }, 
		{ 602, 1 }, 
		{ 625, 0 }, 
		{ 602, 1 }, 
		{ 621, 0 }, 
		{ 213, 1 }, 
		{ 50, 0 }, 
};

static void stm32_irtim_txworker(FAR void *arg)
{
  irqstate_t flags = 0;
  uint32_t period_reg;

  struct stm32_irtim_dev_s *ir_dev = (struct stm32_irtim_dev_s *)arg;

  rcinfo("txworker RC send raw data len: %d\n", RAW_DATA_LEN);




  // ir_dev->irtim[1]->ops->setisr(ir_dev->irtim[1], irtim_isr, ir_dev, 0);  
  // ir_dev->irtim[1]->ops->enableint(ir_dev->irtim[1], 0);
  ir_dev->irtim[1]->ops->setmode(ir_dev->irtim[1], STM32L4_TIM_MODE_UP);
  // ir_dev->irtim[1]->ops->setfreq(ir_dev->irtim[1], 3000);
  ir_dev->irtim[1]->ops->setclock(ir_dev->irtim[1], 2*1000*1000); // 2MHz --> t=0.5 micro-second
  ir_dev->irtim[1]->ops->setperiod(ir_dev->irtim[1], 333*2); // 333 micro-senond
  ir_dev->irtim[1]->ops->setchannel(ir_dev->irtim[1], 1, STM32L4_TIM_CH_FORCE_LO);  
  period_reg = ir_dev->irtim[1]->ops->getperiod(ir_dev->irtim[1]);
  ir_dev->irtim[1]->ops->setcompare(ir_dev->irtim[1], 1, period_reg);  
  ir_dev->irtim[1]->ops->enable(ir_dev->irtim[1]);

  ir_dev->irtim[0]->ops->setmode(ir_dev->irtim[0], STM32L4_TIM_MODE_UP);
  ir_dev->irtim[0]->ops->setfreq(ir_dev->irtim[0], 42000);
  period_reg = ir_dev->irtim[0]->ops->getperiod(ir_dev->irtim[0]);
  ir_dev->irtim[0]->ops->setchannel(ir_dev->irtim[0], 1, STM32L4_TIM_CH_OUTPWM);  
  ir_dev->irtim[0]->ops->setcompare(ir_dev->irtim[0], 1, period_reg * 0.4);  
  ir_dev->irtim[0]->ops->enable(ir_dev->irtim[0]);

  flags = enter_critical_section();

  for(int i = 0; i < RAW_DATA_LEN; i++){
    if (test_ir_raw[i][1])
    {
      ir_dev->irtim[1]->ops->setchannel(ir_dev->irtim[1], 1, STM32L4_TIM_CH_FORCE_HI);
    }
    else
    {
      ir_dev->irtim[1]->ops->setchannel(ir_dev->irtim[1], 1, STM32L4_TIM_CH_FORCE_LO);  
    }
    up_udelay(test_ir_raw[i][0]);
  }

  leave_critical_section(flags);

  rcinfo("txworker RC send done\n");

  ir_dev->sndOpCompleteFlag = 0x01;

  /* TIM IT Disable */
  ir_dev->irtim[1]->ops->disableint(ir_dev->irtim[1], 0);
  ir_dev->sndOpRdyFlag = 0;
  ir_dev->bitsSndCnt = 0;
  ir_dev->irtim[1]->ops->setchannel(ir_dev->irtim[1], 1, STM32L4_TIM_CH_DISABLED);  

  /* TIM Disable */
  ir_dev->irtim[1]->ops->disable(ir_dev->irtim[1]);

}

#elif defined(MIDEA_MODE)
#define RAW_DATA_LEN     100 
uint32_t test_ir_raw[RAW_DATA_LEN][2] = {
		{ 8455, 1 }, 
		{ 4167, 0 }, 
		{ 560, 1 }, 
		{ 1537, 0 }, 
		{ 563, 1 }, 
		{ 485, 0 }, 
		{ 563, 1 }, 
		{ 485, 0 }, 
		{ 563, 1 }, 
		{ 484, 0 }, 
		{ 563, 1 }, 
		{ 486, 0 }, 
		{ 563, 1 }, 
		{ 485, 0 }, 
		{ 563, 1 }, 
		{ 486, 0 }, 
		{ 562, 1 }, 
		{ 485, 0 }, 
		{ 564, 1 }, 
		{ 485, 0 }, 
		{ 563, 1 }, 
		{ 1533, 0 }, 
		{ 564, 1 }, 
		{ 1534, 0 }, 
		{ 563, 1 }, 
		{ 1533, 0 }, 
		{ 563, 1 }, 
		{ 1533, 0 }, 
		{ 563, 1 }, 
		{ 1534, 0 }, 
		{ 563, 1 }, 
		{ 1533, 0 }, 
		{ 562, 1 }, 
		{ 1534, 0 }, 
		{ 563, 1 }, 
		{ 1533, 0 }, 
		{ 562, 1 }, 
		{ 1534, 0 }, 
		{ 563, 1 }, 
		{ 485, 0 }, 
		{ 563, 1 }, 
		{ 484, 0 }, 
		{ 563, 1 }, 
		{ 484, 0 }, 
		{ 563, 1 }, 
		{ 484, 0 }, 
		{ 553, 1 }, 
		{ 497, 0 }, 
		{ 557, 1 }, 
		{ 490, 0 }, 
		{ 546, 1 }, 
		{ 502, 0 }, 
		{ 563, 1 }, 
		{ 485, 0 }, 
		{ 563, 1 }, 
		{ 1533, 0 }, 
		{ 563, 1 }, 
		{ 1534, 0 }, 
		{ 562, 1 }, 
		{ 1535, 0 }, 
		{ 561, 1 }, 
		{ 1533, 0 }, 
		{ 564, 1 }, 
		{ 1534, 0 }, 
		{ 562, 1 }, 
		{ 1534, 0 }, 
		{ 550, 1 }, 
		{ 1546, 0 }, 
		{ 563, 1 }, 
		{ 1533, 0 }, 
		{ 563, 1 }, 
		{ 486, 0 }, 
		{ 541, 1 }, 
		{ 505, 0 }, 
		{ 563, 1 }, 
		{ 485, 0 }, 
		{ 562, 1 }, 
		{ 486, 0 }, 
		{ 562, 1 }, 
		{ 485, 0 }, 
		{ 547, 1 }, 
		{ 501, 0 }, 
		{ 562, 1 }, 
		{ 485, 0 }, 
		{ 540, 1 }, 
		{ 508, 0 }, 
		{ 540, 1 }, 
		{ 1556, 0 }, 
		{ 541, 1 }, 
		{ 1557, 0 }, 
		{ 540, 1 }, 
		{ 1557, 0 }, 
		{ 540, 1 }, 
		{ 1556, 0 }, 
		{ 562, 1 }, 
		{ 1533, 0 }, 
		{ 541, 1 }, 
		{ 1557, 0 }, 
		{ 540, 1 }, 
		{ 50, 0 }, 
};



static void stm32_irtim_txworker(FAR void *arg)
{
  irqstate_t flags = 0;
  uint32_t period_reg;

