lanpinguo/nuttx/boards/arm/stm32l4/nucleo-l452re/src/stm32_ir.c
  struct stm32_irtim_dev_s *ir_dev = (struct stm32_irtim_dev_s *)arg;

  rcinfo("txworker RC send raw data len: %d\n", RAW_DATA_LEN);




  // ir_dev->irtim[1]->ops->setisr(ir_dev->irtim[1], irtim_isr, ir_dev, 0);  
  // ir_dev->irtim[1]->ops->enableint(ir_dev->irtim[1], 0);
  ir_dev->irtim[1]->ops->setmode(ir_dev->irtim[1], STM32L4_TIM_MODE_UP);
  // ir_dev->irtim[1]->ops->setfreq(ir_dev->irtim[1], 3000);
  ir_dev->irtim[1]->ops->setclock(ir_dev->irtim[1], 2*1000*1000); // 2MHz --> t=0.5 micro-second
  ir_dev->irtim[1]->ops->setperiod(ir_dev->irtim[1], 333*2); // 333 micro-senond
  ir_dev->irtim[1]->ops->setchannel(ir_dev->irtim[1], 1, STM32L4_TIM_CH_FORCE_LO);  
  period_reg = ir_dev->irtim[1]->ops->getperiod(ir_dev->irtim[1]);
  ir_dev->irtim[1]->ops->setcompare(ir_dev->irtim[1], 1, period_reg);  
  ir_dev->irtim[1]->ops->enable(ir_dev->irtim[1]);

  ir_dev->irtim[0]->ops->setmode(ir_dev->irtim[0], STM32L4_TIM_MODE_UP);
  ir_dev->irtim[0]->ops->setfreq(ir_dev->irtim[0], 38000);
  period_reg = ir_dev->irtim[0]->ops->getperiod(ir_dev->irtim[0]);
  ir_dev->irtim[0]->ops->setchannel(ir_dev->irtim[0], 1, STM32L4_TIM_CH_OUTPWM);  
  ir_dev->irtim[0]->ops->setcompare(ir_dev->irtim[0], 1, period_reg / 2);  
  ir_dev->irtim[0]->ops->enable(ir_dev->irtim[0]);

  flags = enter_critical_section();

  for(int i = 0; i < RAW_DATA_LEN; i++){
    if (test_ir_raw[i][1])
    {
      ir_dev->irtim[1]->ops->setchannel(ir_dev->irtim[1], 1, STM32L4_TIM_CH_FORCE_HI);
    }
    else
    {
      ir_dev->irtim[1]->ops->setchannel(ir_dev->irtim[1], 1, STM32L4_TIM_CH_FORCE_LO);  
    }
    up_udelay(test_ir_raw[i][0]);
  }

  leave_critical_section(flags);

  rcinfo("txworker RC send done\n");

  ir_dev->sndOpCompleteFlag = 0x01;

  /* TIM IT Disable */
  ir_dev->irtim[1]->ops->disableint(ir_dev->irtim[1], 0);
  ir_dev->sndOpRdyFlag = 0;
  ir_dev->bitsSndCnt = 0;
  ir_dev->irtim[1]->ops->setchannel(ir_dev->irtim[1], 1, STM32L4_TIM_CH_DISABLED);  

  /* TIM Disable */
  ir_dev->irtim[1]->ops->disable(ir_dev->irtim[1]);

}

#elif defined(HAIR_MODE)
#define RAW_DATA_LEN     68 
uint32_t test_ir_raw[RAW_DATA_LEN][2] = {
		{ 8508, 1 }, 
		{ 4287, 0 }, 
		{ 548, 1 }, 
		{ 534, 0 }, 
		{ 574, 1 }, 
		{ 1612, 0 }, 
		{ 548, 1 }, 
		{ 527, 0 }, 
		{ 571, 1 }, 
		{ 558, 0 }, 
		{ 547, 1 }, 
		{ 536, 0 }, 
		{ 573, 1 }, 
		{ 1614, 0 }, 
		{ 544, 1 }, 
		{ 538, 0 }, 
		{ 571, 1 }, 
		{ 559, 0 }, 
		{ 547, 1 }, 
		{ 1589, 0 }, 
		{ 573, 1 }, 
		{ 558, 0 }, 
		{ 549, 1 }, 
		{ 1590, 0 }, 
		{ 572, 1 }, 
		{ 1618, 0 }, 
		{ 546, 1 }, 
		{ 1590, 0 }, 
		{ 573, 1 }, 
		{ 557, 0 }, 
		{ 546, 1 }, 
		{ 1590, 0 }, 
		{ 571, 1 }, 
		{ 1616, 0 }, 
		{ 546, 1 }, 
		{ 536, 0 }, 
		{ 572, 1 }, 
		{ 1614, 0 }, 
		{ 546, 1 }, 
		{ 1590, 0 }, 
		{ 573, 1 }, 
		{ 558, 0 }, 
		{ 547, 1 }, 
		{ 1589, 0 }, 
		{ 551, 1 }, 
		{ 1634, 0 }, 
		{ 547, 1 }, 
		{ 536, 0 }, 
		{ 571, 1 }, 
		{ 1615, 0 }, 
		{ 546, 1 }, 
		{ 1589, 0 }, 
		{ 544, 1 }, 
		{ 584, 0 }, 
		{ 516, 1 }, 
		{ 552, 0 }, 
		{ 541, 1 }, 
		{ 1640, 0 }, 
		{ 545, 1 }, 
		{ 536, 0 }, 
		{ 569, 1 }, 
		{ 562, 0 }, 
		{ 545, 1 }, 
		{ 1590, 0 }, 
		{ 570, 1 }, 
		{ 562, 0 }, 
		{ 517, 1 }, 
		{ 50, 0 }, 
};



static void stm32_irtim_txworker(FAR void *arg)
{
  irqstate_t flags = 0;
  uint32_t period_reg;

  struct stm32_irtim_dev_s *ir_dev = (struct stm32_irtim_dev_s *)arg;

  rcinfo("txworker RC send raw data len: %d\n", RAW_DATA_LEN);




  // ir_dev->irtim[1]->ops->setisr(ir_dev->irtim[1], irtim_isr, ir_dev, 0);  
  // ir_dev->irtim[1]->ops->enableint(ir_dev->irtim[1], 0);
  ir_dev->irtim[1]->ops->setmode(ir_dev->irtim[1], STM32L4_TIM_MODE_UP);
  // ir_dev->irtim[1]->ops->setfreq(ir_dev->irtim[1], 3000);
  ir_dev->irtim[1]->ops->setclock(ir_dev->irtim[1], 2*1000*1000); // 2MHz --> t=0.5 micro-second
  ir_dev->irtim[1]->ops->setperiod(ir_dev->irtim[1], 333*2); // 333 micro-senond
  ir_dev->irtim[1]->ops->setchannel(ir_dev->irtim[1], 1, STM32L4_TIM_CH_FORCE_LO);  
  period_reg = ir_dev->irtim[1]->ops->getperiod(ir_dev->irtim[1]);
  ir_dev->irtim[1]->ops->setcompare(ir_dev->irtim[1], 1, period_reg);  
  ir_dev->irtim[1]->ops->enable(ir_dev->irtim[1]);

  ir_dev->irtim[0]->ops->setmode(ir_dev->irtim[0], STM32L4_TIM_MODE_UP);
  ir_dev->irtim[0]->ops->setfreq(ir_dev->irtim[0], 38000);
  period_reg = ir_dev->irtim[0]->ops->getperiod(ir_dev->irtim[0]);
  ir_dev->irtim[0]->ops->setchannel(ir_dev->irtim[0], 1, STM32L4_TIM_CH_OUTPWM);  
  ir_dev->irtim[0]->ops->setcompare(ir_dev->irtim[0], 1, period_reg / 2);  
  ir_dev->irtim[0]->ops->enable(ir_dev->irtim[0]);

  flags = enter_critical_section();

  for(int i = 0; i < RAW_DATA_LEN; i++){
    if (test_ir_raw[i][1])
    {
      ir_dev->irtim[1]->ops->setchannel(ir_dev->irtim[1], 1, STM32L4_TIM_CH_FORCE_HI);
    }
    else
    {
      ir_dev->irtim[1]->ops->setchannel(ir_dev->irtim[1], 1, STM32L4_TIM_CH_FORCE_LO);  
    }
    up_udelay(test_ir_raw[i][0]);
  }

  leave_critical_section(flags);

  rcinfo("txworker RC send done\n");

  ir_dev->sndOpCompleteFlag = 0x01;

  /* TIM IT Disable */
  ir_dev->irtim[1]->ops->disableint(ir_dev->irtim[1], 0);
  ir_dev->sndOpRdyFlag = 0;
  ir_dev->bitsSndCnt = 0;
  ir_dev->irtim[1]->ops->setchannel(ir_dev->irtim[1], 1, STM32L4_TIM_CH_DISABLED);  

  /* TIM Disable */
  ir_dev->irtim[1]->ops->disable(ir_dev->irtim[1]);

}


#endif

static int stm32_irtim_tx_ir(FAR struct lirc_lowerhalf_s *lower,
                       unsigned *txbuf, unsigned int n)
{

  uint32_t period_reg;

  struct stm32_irtim_dev_s *ir_dev = (struct stm32_irtim_dev_s *)lower;

  if(n > STM32_L4_IR_MAX_BUF_SIZE){
    return -EINVAL;
  }

  rcinfo("Dummy RC send raw data:%d(size:%d) to device\n", *txbuf, n);

#if 0  
  ir_dev->bitsSndCnt = 0;
  ir_dev->globalFrameLen = n * 32;
  ir_dev->sndOpRdyFlag = 0;
  ir_dev->sndOpCompleteFlag = 0;
  ir_dev->cursor = 0;
  ir_dev->wordBitsSndCnt = 0;

  for(int i = 0; i < n && i < STM32_L4_IR_MAX_BUF_SIZE; i++){
    ir_dev->frameFmt[i] = txbuf[i];
  }

  ir_dev->irtim[0]->ops->setmode(ir_dev->irtim[0], STM32L4_TIM_MODE_UP);
  ir_dev->irtim[0]->ops->setfreq(ir_dev->irtim[0], 43300);
  period_reg = ir_dev->irtim[0]->ops->getperiod(ir_dev->irtim[0]);
  ir_dev->irtim[0]->ops->setchannel(ir_dev->irtim[0], 1, STM32L4_TIM_CH_OUTPWM);  
  ir_dev->irtim[0]->ops->setcompare(ir_dev->irtim[0], 1, period_reg / 2);  
  ir_dev->irtim[0]->ops->enable(ir_dev->irtim[0]);

  ir_dev->irtim[1]->ops->setisr(ir_dev->irtim[1], irtim_isr, ir_dev, 0);  
  ir_dev->irtim[1]->ops->enableint(ir_dev->irtim[1], 0);
  ir_dev->irtim[1]->ops->setmode(ir_dev->irtim[1], STM32L4_TIM_MODE_UP);
  // ir_dev->irtim[1]->ops->setfreq(ir_dev->irtim[1], 3000);
  ir_dev->irtim[1]->ops->setclock(ir_dev->irtim[1], 2*1000*1000); // 2MHz --> t=0.5 micro-second
  ir_dev->irtim[1]->ops->setperiod(ir_dev->irtim[1], 333*2); // 333 micro-senond
  ir_dev->irtim[1]->ops->setchannel(ir_dev->irtim[1], 1, STM32L4_TIM_CH_FORCE_LO);  
  // ir_dev->irtim[1]->ops->setchannel(ir_dev->irtim[1], 1, STM32L4_TIM_CH_OUTPWM);  
  period_reg = ir_dev->irtim[1]->ops->getperiod(ir_dev->irtim[1]);
  ir_dev->irtim[1]->ops->setcompare(ir_dev->irtim[1], 1, period_reg);  
  ir_dev->irtim[1]->ops->enable(ir_dev->irtim[1]);


