lanpinguo/nuttx/boards/arm/stm32l4/nucleo-l452re/src/stm32_ir.c
  for(int i = 0 ; i < n ; i++){
    rcinfo("Send IR-Code: %08x \n", ir_dev->frameFmt[i]);
  }

#else
    DEBUGASSERT(work_available(&ir_dev->work));

    return work_queue(HPWORK, &ir_dev->work,
                    stm32_irtim_txworker, (FAR void *)ir_dev, 0);

#endif
  return n;
}

static int stm32_irtim_tx_scancode(FAR struct lirc_lowerhalf_s *lower,
                             FAR struct lirc_scancode *txbuf)
{
  rcinfo("Dummy RC send scancode data:%" PRIu64 " to device\n",
         txbuf->scancode);
  return 0;
}

static int stm32_irtim_s_learning_mode(FAR struct lirc_lowerhalf_s *lower,
                                 int enable)
{
  rcinfo("Called %s, enable:%d\n", __func__, enable);
  return 0;
}

static int stm32_irtim_s_carrier_report(FAR struct lirc_lowerhalf_s *lower,
                                  int enable)
{
  rcinfo("Called %s, enable:%d\n", __func__, enable);
  return 0;
}

static int stm32_irtim_s_timeout(FAR struct lirc_lowerhalf_s *lower,
                           unsigned int timeout)
{
  rcinfo("Called %s, timeout:%u\n", __func__, timeout);
  return 0;
}




/****************************************************************************
 * Public Functions
 ****************************************************************************/

int stm32_irtim_irtim_initialize(int devno)
{
  uint32_t reg;
  struct stm32_irtim_dev_s *ir_dev;

  ir_dev = kmm_malloc(sizeof(*ir_dev));
  if (!ir_dev)
    {
      rcerr("failed to alloc memory for ir_dev\n");
      return -ENOMEM;
    }


#if 1


  /* activate the high current sink capability */

  reg  = getreg32(STM32L4_SYSCFG_CFGR1);
  reg |= SYSCFG_CFGR1_I2C_PB9_FMP;
  putreg32(reg, STM32L4_SYSCFG_CFGR1);

  stm32l4_configgpio(GPIO_IR_OUT);
  stm32l4_configgpio(GPIO_TIM15_CH1OUT);
  stm32l4_configgpio(GPIO_TIM16_CH1OUT);


  ir_dev->irtim[0] = stm32l4_tim_init(15);
  ir_dev->irtim[1] = stm32l4_tim_init(16);


#endif



  ir_dev->lower.ops = &g_stm32_irtim_ops;
  ir_dev->lower.buffer_bytes = STM32_L4_IR_MAX_EVENT_SIZE * sizeof(unsigned);

  ir_dev->work.worker = NULL;
  ir_dev->test_sample = 0;

  return lirc_register(&ir_dev->lower, devno);
}

/****************************************************************************
 * Name: stm32l4_ir_setup
 ****************************************************************************/

int stm32l4_ir_setup(void)
{
  int ret;
  static bool initialized = false;
  int devno = 0;


  if (!initialized)
    {


      ret = stm32_irtim_irtim_initialize(devno);
      if (ret < 0)
        {
          snerr("ERROR: stm32_irtim_initialize failed\n");
          // goto drv_err;
        }


      initialized = true;
    }

  return OK;
}
